/* 選單項目和視窗標題 */
"NINE_BOX_VIEW" = "九宮格預覽 Pro";

/* 參考字符區域 */
"REFERENCE_INPUT_PLACEHOLDER" = "輸入參考字符…";
"SAVE_REFERENCE_BUTTON" = "儲存";
"SAVE_REFERENCE_TOOLTIP" = "儲存到參考字組";

/* 主題切換按鈕 */
"THEME_TOGGLE_LIGHT_TOOLTIP" = "切換至深色模式";
"THEME_TOGGLE_DARK_TOOLTIP" = "切換至淺色模式";

/* 參考字面板切換按鈕 */
"REFERENCE_PANEL_SHOW_TOOLTIP" = "顯示參考字面板";
"REFERENCE_PANEL_HIDE_TOOLTIP" = "隱藏參考字面板";

/* 參考字視窗標題 */
"REFERENCE_PANEL_TITLE" = "參考字";

/* 鎖定字視窗標題*/
"LOCKED_PANEL_TITLE" = "鎖定字";

/* 字組面板切換按鈕*/
"PRESETS_TOGGLE_SHOW_TOOLTIP" = "顯示字組面板";
"PRESETS_TOGGLE_HIDE_TOOLTIP" = "隱藏字組面板";

/* 字組視窗標題*/
"PRESETS_WINDOW_TITLE" = "字組";

/* 模糊滑桿 */
"BLUR_SLIDER_TOOLTIP" = "模糊程度";

/* 字符選擇器 */
"GLYPH_PICKER_TITLE_LOCK" = "選擇鎖定字符";
"GLYPH_PICKER_TITLE_REFERENCE" = "選擇參考字符";

/* 右鍵選單（參考字輸入區） */
"CONTEXT_MENU_GLYPH_PICKER" = "字符選擇器…";

/* 標題列選單按鈕*/
"TITLEBAR_MENU_TOOLTIP" = "選單";

/* 資訊選單*/
"INFO_MENU_HELP" = "使用說明";
"INFO_MENU_WEBSITE" = "官方網站";
"INFO_MENU_FEEDBACK" = "意見回饋…";
"INFO_MENU_CONTACT_US" = "聯絡我們…";
"INFO_MENU_TESTIMONIAL" = "分享使用心得…";
"INFO_MENU_PURCHASE" = "購買…";

/* 鎖定切換按鈕（主視窗工具列） */
"LOCK_TOGGLE_ENABLED_TOOLTIP" = "鎖定字符已顯示（按住 Cmd 編輯）";
"LOCK_TOGGLE_DISABLED_TOOLTIP" = "鎖定字符已隱藏（按住 Cmd 編輯）";

/* 鎖定字面板*/
"CLEAR_LOCKED_BUTTON" = "清除";
"CLEAR_LOCKED_TOOLTIP" = "清除所有鎖定字";
"SAVE_LOCKED_BUTTON" = "儲存";
"SAVE_LOCKED_TOOLTIP" = "儲存到鎖定字組";
"LOCKED_PANEL_TOGGLE_SHOW" = "顯示鎖定字面板";
"LOCKED_PANEL_TOGGLE_HIDE" = "隱藏鎖定字面板";

/* 參考字符輸入對話框 */
"REFERENCE_INPUT_CANCEL" = "取消";

/* 工具列切換按鈕 */
"TOOLBAR_TOGGLE_HIDE_TOOLTIP" = "隱藏工具列";
"TOOLBAR_TOGGLE_SHOW_TOOLTIP" = "顯示工具列";

/* 授權狀態 */
"LICENSE_TRIAL_REMAINING" = "試用期：剩餘 %ld 天";
"LICENSE_TRIAL_DAYS" = "剩餘 %ld 天";
"LICENSE_ACTIVATED" = "授權給：%@";

/* 授權輸入對話框 */
"LICENSE_INPUT_TITLE" = "啟用授權";
"LICENSE_INPUT_CANCEL" = "取消";
"LICENSE_INPUT_BUY" = "購買…";
"LICENSE_INPUT_CONTACT" = "聯絡客服";

/* 授權拖放區域 */
"LICENSE_DROP_HINT" = "將 .license 檔案拖曳至此";
"LICENSE_DROP_ACTIVE" = "放開以啟用授權";

/* 授權錯誤訊息 */
"LICENSE_ERROR_INVALID_KEY" = "序號無效。";
"LICENSE_ERROR_INVALID_EMAIL" = "無效的電子郵件。";
"LICENSE_ERROR_INVALID_FILE" = "無效的授權檔案。";
"LICENSE_ERROR_WRONG_PRODUCT" = "此授權非 NineBoxView 專用。";
"LICENSE_ERROR_MISSING_FIELDS" = "授權檔案不完整。";
"LICENSE_ERROR_REVOKED" = "此序號已被撤銷。";
"LICENSE_VERIFYING" = "正在驗證授權...";

/* 授權啟用成功 */
"LICENSE_ACTIVATION_SUCCESS_TITLE" = "授權啟用成功";
"LICENSE_ACTIVATION_SUCCESS_OK" = "好";

/* 試用期過期畫面 */
"LICENSE_EXPIRED_WINDOW_TITLE" = "九宮格預覽 Pro";
"LICENSE_EXPIRED_TITLE" = "試用期已結束";
"LICENSE_EXPIRED_MESSAGE" = "您的 14 天試用期已結束。\n請購買授權以繼續使用九宮格預覽 Pro。";
"LICENSE_EXPIRED_PURCHASE" = "購買授權";
"LICENSE_EXPIRED_ENTER_KEY" = "輸入序號";
"LICENSE_EXPIRED_FREE_VERSION" = "使用免費版";

/* 資訊選單*/
"INFO_MENU_ENTER_LICENSE" = "輸入授權碼…";

/* 歡迎對話框 */
"LICENSE_WELCOME_TITLE" = "歡迎使用九宮格預覽 Pro";
"LICENSE_WELCOME_MESSAGE" = "體驗強大的九宮格預覽功能，幫助您做出更好的字符設計決策。\n\n點擊下方按鈕後，您的 14 天免費試用期將正式開始。";
"LICENSE_WELCOME_START_TRIAL" = "開始 14 天試用";
"LICENSE_WELCOME_ENTER_KEY" = "輸入序號";

/* 拖曳提示 */
"Open Grid in New Tab" = "在新分頁中開啟九宮格";

/* 控制盤分頁*/
"PALETTE_TAB_REFERENCE" = "參考";
"PALETTE_TAB_LOCKED" = "鎖定";

/* 控制盤右鍵選單*/
"PALETTE_MENU_PIN" = "釘選";
"PALETTE_MENU_UNPIN" = "取消釘選";
"PALETTE_MENU_RENAME" = "重新命名…";
"PALETTE_MENU_OVERWRITE" = "以當前取代";
"PALETTE_MENU_DELETE" = "刪除";

/* 控制盤右鍵選單 - 多選*/
"PALETTE_MENU_DELETE_MULTIPLE" = "刪除 %lu 個項目";
"PALETTE_MENU_PIN_MULTIPLE" = "釘選 %lu 個項目";
"PALETTE_MENU_UNPIN_MULTIPLE" = "取消釘選 %lu 個項目";

/* 控制盤空狀態*/
"PALETTE_EMPTY_REFERENCE" = "尚無參考字組\n+ 新增";
"PALETTE_EMPTY_LOCKED" = "尚無鎖定字組\n+ 新增";

/* 控制盤覆蓋確認*/
"PALETTE_OVERWRITE_CONFIRM_TITLE" = "確認覆寫";
"PALETTE_OVERWRITE_CONFIRM_MESSAGE" = "這將覆寫字組內容，無法復原。";
"PALETTE_OVERWRITE_CONFIRM_OK" = "覆寫";

/* 九宮格右鍵選單*/
"CONTEXT_MENU_SHOW_REFERENCE_INPUT" = "顯示參考字面板";
"CONTEXT_MENU_HIDE_REFERENCE_INPUT" = "隱藏參考字面板";
"CONTEXT_MENU_SHOW_LOCKED_PANEL" = "顯示鎖定字面板";
"CONTEXT_MENU_HIDE_LOCKED_PANEL" = "隱藏鎖定字面板";
"CONTEXT_MENU_SHOW_PRESETS" = "顯示字組面板";
"CONTEXT_MENU_HIDE_PRESETS" = "隱藏字組面板";
"CONTEXT_MENU_SHOW_TOOLBAR" = "顯示工具列";
"CONTEXT_MENU_HIDE_TOOLBAR" = "隱藏工具列";
"CONTEXT_MENU_LIGHT_MODE" = "淺色模式";
"CONTEXT_MENU_DARK_MODE" = "深色模式";
/* 格線（Issue #422） */
"CONTEXT_MENU_SHOW_GRID_LINES" = "顯示格線";
"CONTEXT_MENU_HIDE_GRID_LINES" = "隱藏格線";
"CONTEXT_MENU_GRID_STYLE" = "格線樣式";
"GRID_STYLE_FIELD" = "田字格";
"GRID_STYLE_ASTERISK" = "米字格";
"GRID_STYLE_HASH" = "井字格";
/* 格線工具列按鈕（Option+點擊：設定）*/
"GRID_TOGGLE_SHOW_TOOLTIP" = "顯示格線（Option：設定）";
"GRID_TOGGLE_HIDE_TOOLTIP" = "隱藏格線（Option：設定）";
/* 回字格（Issue #435）*/
"CONTEXT_MENU_SHOW_COUNTER_FRAME" = "顯示字面框";
"CONTEXT_MENU_HIDE_COUNTER_FRAME" = "隱藏字面框";
"CONTEXT_MENU_GRID_SETTINGS" = "格線設定…";
"GRID_STYLE_LABEL" = "樣式";
"COUNTER_FRAME_LABEL" = "字面框";

/* 九宮格右鍵選單 - 字符操作*/
"CONTEXT_MENU_INSERT_AT_CURSOR" = "插入當前分頁";
"CONTEXT_MENU_OPEN_IN_NEW_TAB" = "在新分頁中打開";

/* 匯入/匯出選單*/
"PRESETS_MENU_IMPORT" = "匯入⋯";
"PRESETS_MENU_EXPORT_SELECTED" = "匯出選取字組⋯";
"PRESETS_MENU_EXPORT_ALL" = "匯出所有字組⋯";

/* 匯入模式對話框*/
"PRESETS_IMPORT_MODE_TITLE" = "匯入字組";
"PRESETS_IMPORT_MODE_MESSAGE" = "發現 %lu 個字組。要如何匯入？";
"PRESETS_IMPORT_MODE_APPEND" = "追加";
"PRESETS_IMPORT_MODE_REPLACE" = "全部取代";

/* 匯入錯誤*/
"PRESETS_IMPORT_ERROR_TITLE" = "匯入失敗";
"PRESETS_IMPORT_ERROR_INVALID_FORMAT" = "檔案格式無效。";
"PRESETS_IMPORT_ERROR_UNSUPPORTED_VERSION" = "此檔案由較新版本建立，請更新外掛。";
"PRESETS_IMPORT_ERROR_TYPE_MISMATCH" = "此檔案包含%@字組，但您目前在%@分頁。";
"PRESETS_IMPORT_ERROR_EMPTY" = "此檔案中沒有有效的字組。";

/* 匯出錯誤*/
"PRESETS_EXPORT_ERROR_TITLE" = "匯出失敗";
"PRESETS_EXPORT_ERROR_MESSAGE" = "無法儲存檔案：%@";

/* 類型名稱*/
"PRESETS_TYPE_REFERENCE" = "參考字";
"PRESETS_TYPE_LOCKED" = "鎖定字";

/* 搜尋欄位 placeholder*/
"SEARCH_PRESETS_PLACEHOLDER" = "搜尋字組…";
"SEARCH_NO_RESULTS" = "找不到結果";

/* 排序選項*/
"SORT_NAME_AZ" = "名稱 A → Z";
"SORT_NAME_ZA" = "名稱 Z → A";
"SORT_DATE_NEWEST" = "加入日期（新→舊）";
"SORT_DATE_OLDEST" = "加入日期（舊→新）";

/* 排序按鈕提示*/
"SORT_BUTTON_TOOLTIP" = "排序方式";

/* 關於視窗*/
"ABOUT_MENU_ITEM" = "關於九宮格預覽 Pro…";
"ABOUT_WINDOW_TITLE" = "關於";
"ABOUT_LICENSED_TO" = "授權給：";
"ABOUT_LINK_WEBSITE" = "官方網站";
"ABOUT_LINK_HELP" = "使用說明";
"ABOUT_TRIAL_STATUS" = "試用中";
"ABOUT_TRIAL_EXPIRED" = "試用過期";
"ABOUT_STATUS_LICENSED" = "已授權";
"ABOUT_STATUS_UNLICENSED" = "未授權";

/* 清除授權*/
"ABOUT_DEACTIVATE_LICENSE" = "清除授權";
"ABOUT_DEACTIVATE_CONFIRM_TITLE" = "確定要清除授權？";
"ABOUT_DEACTIVATE_CONFIRM_MESSAGE" = "授權資訊將從這台電腦移除。您可以隨時使用序號重新啟用。";
"ABOUT_DEACTIVATE_CONFIRM_OK" = "清除";
"ABOUT_DEACTIVATE_CONFIRM_CANCEL" = "取消";
